app/Controllers/Cart_controller.php

SELECT *
FROM `usuarios`
WHERE `id_usuarios` = '12'
 LIMIT 1
SELECT *
FROM `productos`
WHERE `id_producto` = '10'
 LIMIT 1
INSERT INTO `ventas` (`cliente_id`, `venta_fecha`) VALUES ('12', '2025-06-18')
---
    public function guardar_venta(){
        $cart = \Config\Services::cart();
        $producto = new Productos_model();
        $detalle = new Detalle_ventas_model();
        $venta = new \App\Models\Ventas_model();
        $usuarioModel = new \App\Models\Usuarios_model();

        $usuario = $usuarioModel->where('id_usuarios', session('id'))->first();

        if(!$usuario['telefono_usuarios'] || !$usuario['dni_usuarios']){
            return redirect()->route('perfil')->with('mensaje', 'Por favor, complete su perfil antes de realizar una compra.');
        }

        $carrito = $cart->contents();

        foreach ($carrito as $item) {
            $productos = $producto->where('id_producto', $item['id'])->first();
            if ($productos['producto_cantidad'] < $item['qty']) {
                return redirect()->route('ver_carrito')->with('mensaje', 'No hay suficiente stock para el producto '. $item['name'] .'.');
            }
        }

        $data = array(
            'cliente_id' => session('id'),
            'venta_fecha' => date('Y-m-d'),
        );

        $venta_id = $venta->insert($data);

SELECT *
FROM `productos`
WHERE `id_producto` = '10'
 LIMIT 1
---
                'detalle_cantidad' => $item['qty'],
                'detalle_precio' => $item['price'],
            );
            $productos = $producto->where('id_producto', $item['id'])->first();

UPDATE `productos` SET `producto_cantidad` = 7
WHERE `productos`.`id_producto` IN ('10')
INSERT INTO `detalle_ventas` (`venta_id`, `producto_id`, `detalle_cantidad`, `detalle_precio`) VALUES (28, '10', 1, 90000)
---
                'producto_cantidad' => $productos['producto_cantidad'] - $item['qty'],
            ];

            $producto->update($item['id'], $data);

            $detalle->insert($detalle_venta);

SELECT *
FROM `ventas`
JOIN `usuarios` ON `usuarios`.`id_usuarios` = `ventas`.`cliente_id`
WHERE `venta_fecha` >= '2025-06-26'
AND `venta_fecha` <= '2025-06-27'
SELECT *
FROM `detalle_ventas`
JOIN `ventas` ON `ventas`.`id_ventas` = `detalle_ventas`.`venta_id`
JOIN `productos` ON `productos`.`id_producto` = `detalle_ventas`.`producto_id`
---
    public function listar_ventas(){
        $venta = new Ventas_model();
        $detalle = new Detalle_ventas_model();
        $producto = new Productos_model();

        // Filtros para la búsqueda
        $nombre = $this->request->getGet('nombre');
        $fecha_inicio = $this->request->getGet('fecha_inicio');
        $fecha_fin = $this->request->getGet('fecha_fin');

        $venta->select('ventas.*, usuarios.nombre_usuarios, usuarios.apellido_usuarios')
            ->join('usuarios', 'usuarios.id_usuarios = ventas.cliente_id');

        if ($nombre) {
            $venta->like('nombre_usuarios', $nombre);
            $venta->orLike('apellido_usuarios', $nombre);
            $venta->orWhere("CONCAT(usuarios.nombre_usuarios, ' ', usuarios.apellido_usuarios) LIKE", "%$nombre%");
        }
        if ($fecha_inicio) {
            $venta->where('venta_fecha >=', $fecha_inicio);
        }
        if ($fecha_fin) {
            $venta->where('venta_fecha <=', $fecha_fin);
        }

        $data['ventas'] = $venta->findAll();

        $data['detalle_ventas'] = $detalle
            ->join('ventas', 'ventas.id_ventas = detalle_ventas.venta_id')
            ->join('productos', 'productos.id_producto = detalle_ventas.producto_id')
            ->findAll();