app/Controllers/Cart_controller.php

    public function listar_ventas(){
        $venta = new Ventas_model();
        $detalle = new Detalle_ventas_model();
        $producto = new Productos_model();
        $data = ['ventas' => $venta
            ->join('usuarios', 'usuarios.id_usuarios = ventas.cliente_id')
            ->findAll()];

        $data['detalle_ventas'] = $detalle
            ->join('ventas', 'ventas.id_ventas = detalle_ventas.venta_id')
            ->join('productos', 'productos.id_producto = detalle_ventas.producto_id')
            ->findAll();
---
SELECT *
FROM `detalle_ventas`
JOIN `ventas` ON `ventas`.`id_ventas` = `detalle_ventas`.`venta_id`
JOIN `productos` ON `productos`.`id_producto` = `detalle_ventas`.`producto_id`
SELECT *
FROM `ventas`
JOIN `usuarios` ON `usuarios`.`id_usuarios` = `ventas`.`cliente_id`