app/Controllers/Productos_controller.php

SELECT *
FROM `categorias`
---
    public function agregar_producto(){
        $categoria = new Categorias_model();
        $data['producto_categoria'] = $categoria->findAll();

SELECT *
FROM `productos`
JOIN `categorias` ON `categorias`.`id_categoria` = `productos`.`producto_categoria`
---
    public function listar_productos(){
        $producto = new Productos_model();
        $categoria = new Categorias_model();
        $data['productos'] = $producto->join('categorias', 'categorias.id_categoria = productos.producto_categoria')->findAll();

SELECT *
FROM `categorias`
SELECT *
FROM `productos`
WHERE `id_producto` = '2'
 LIMIT 1
---
    public function editar_producto($id=null){
        $producto = new Productos_model();
        $categoria = new Categorias_model();
        $data['categoria'] = $categoria->findAll();
        $data['producto'] = $producto->where('id_producto', $id)->first();

SELECT *
FROM `productos`
WHERE `id_producto` = '9'
 LIMIT 1
SELECT *
FROM `categorias`
---
            $producto = new Productos_model();
            $categoria = new Categorias_model();
            $data['validation'] = $validationErrors;
            $data['producto'] = $producto->where('id_producto', $request->getPost('id_producto'))->first();
            $data['categoria'] = $categoria->findAll();

SELECT *
FROM `categorias`
SELECT *
FROM `productos`
JOIN `categorias` ON `categorias`.`id_categoria` = `productos`.`producto_categoria`
WHERE `producto_estado` = 1
AND `producto_cantidad` > 0
---
    public function listar_productos_catalogo(){
        $producto = new Productos_model();
        $categoria = new Categorias_model();
        $data['categoria'] = $categoria->findAll();

        $data['producto'] = $producto->where('producto_estado', 1)->where('producto_cantidad >', 0)
        ->join('categorias', 'categorias.id_categoria = productos.producto_categoria')->findAll();

SELECT *
FROM `categorias`
SELECT *
FROM `productos`
JOIN `categorias` ON `categorias`.`id_categoria` = `productos`.`producto_categoria`
WHERE `producto_estado` = 1
AND `producto_cantidad` > 0
AND `producto_categoria` = '2'
---
    public function filtrado_productos(){
    $producto = new Productos_model();
    $categoriaModel = new Categorias_model();

    // Filtros
    $nombre = $this->request->getGet('nombre');
    $precioMinimo = $this->request->getGet('precio_minimo');
    $precioMaximo = $this->request->getGet('precio_maximo');
    $categoriaSeleccionada = $this->request->getGet('categoria');

    // Construir la consulta
    $producto->where('producto_estado', 1)
             ->where('producto_cantidad >', 0)
             ->join('categorias', 'categorias.id_categoria = productos.producto_categoria');

    if ($nombre) {
        $producto->like('producto_nombre', $nombre);
    }
    if ($precioMinimo) {
        $producto->where('producto_precio >=', $precioMinimo);
    }
    if ($precioMaximo) {
        $producto->where('producto_precio <=', $precioMaximo);
    }
    if ($categoriaSeleccionada) {
        $producto->where('producto_categoria', $categoriaSeleccionada);
    }

    $productos = $producto->findAll();

SELECT *
FROM `categorias`
---
    ];

    $data['producto'] = $productos;
    $data['categoria'] = $categoriaModel->findAll();