app/Controllers/usuarios_controller.php

    public function buscar_usuario(){
        $validation = \Config\Services::validation();
        $request = \Config\Services::request();
        $session = session();
        $validation->setRules([
            'correo' => 'required|valid_email',
            'contrasena' => 'required|min_length[8]'
        ],
        [   //Errors
            'correo' => [
                'required' => 'El correo es obligatorio.',
                'valid_email' => 'El correo debe ser un formato válido.'
            ],
            'contrasena' => [
                'required' => 'La contraseña es obligatoria.',
                'min_length' => 'La contraseña debe tener al menos 8 caracteres.'
            ]
        ]);

        if(!$validation->withRequest($request)->run()){
            $data['titulo'] = 'Inicio de sesión';
            $data['validation'] = $validation->getErrors();
            return view('plantillas/nav_view', $data).view('frontend/inicio_sesion_view').view('plantillas/footer_view');
        }
        $mail = $request->getPost('correo');
        $pass = $request->getPost('contrasena');

        $usuario = new Usuarios_model();
        $user = $usuario->where('correo_usuarios', $mail)->where('persona_estado', 1)->first();
---
SELECT *
FROM `usuarios`
WHERE `correo_usuarios` = 'andresbarberan03@gmail.com'
AND `persona_estado` = 1
 LIMIT 1